Revit 2026 API

# AlphanumericRevisionSettings Constructor

---

Constructs an AlphanumericRevisionSettings with a simple, default sequence.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public AlphanumericRevisionSettings()
```
```vb
Public Sub New
```
```cpp
public:
AlphanumericRevisionSettings()
```
```fsharp
new : unit -> AlphanumericRevisionSettings
```

The default sequence contains each letter of the alphabet (may differ based on language settings).

#### Reference

AlphanumericRevisionSettings Class

AlphanumericRevisionSettings Overload

Autodesk.Revit.DB Namespace